{
	"basics": {
		"name": "Matt Stannett",
		"jobTitle": "Senior Software Engineer",
		"summary": "A driven Software Engineer with the ability to design, implement, and maintain creative solutions that satisfy client needs. Believes in producing elegant, extensible, and well-documented deliverables. An avid consumer of books, documentaries and podcasts, also an amateur military historian. Keeps active through football, mountain biking, and running around after my children.",
		"location": "Hamilton, New Zealand",
		"fullTimeExperienceStartDate": "2014-01-01",
		"picture": "https://www.gravatar.com/avatar/d14a78299ebf996ea9b9054cc3bd26ba.png?s=200",
		"profiles": [
			{
				"network": "GitHub",
				"url": "https://github.com/BeigeBadger",
				"iconName": "github"
			},
			{
				"network": "Stack Overflow",
				"url": "https://stackoverflow.com/users/5209435/matt-stannett",
				"iconName": "stack-overflow"
			},
			{
				"network": "LinkedIn",
				"url": "https://www.linkedin.com/in/matt-stannett-404a63b7/",
				"iconName": "linkedin"
			}
		]
	},
	"skills": [
		{
			"name": "Event-Driven",
			"level": "Intermediate",
			"rating": 4,
			"yearsOfExperience": 3
		},
		{
			"name": "Serverless",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 4
		},
		{
			"name": "Web Applications",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 11
		},
		{
			"name": "Databases",
			"level": "Intermediate",
			"rating": 3,
			"yearsOfExperience": 11
		},
		{
			"name": "Cloud Architecture",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 5
		},
		{
			"name": "IoT (Internet of Things)",
			"level": "Intermediate",
			"rating": 3,
			"yearsOfExperience": 3
		},
		{
			"name": "Unit Testing",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 11
		},
		{
			"name": "CI/CD",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 11
		},
		{
			"name": "Mentoring/Coaching",
			"level": "Intermediate",
			"rating": 3,
			"yearsOfExperience": 5
		},
		{
			"name": "Infrastructure as Code",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 5
		},
		{
			"name": "Data Platforms",
			"level": "Beginner-Intermediate",
			"rating": 2.5,
			"yearsOfExperience": 2
		},
		{
			"name": "Prompt Engineering",
			"level": "Intermediate",
			"rating": 3,
			"yearsOfExperience": 2
		},
		{
			"name": "Documentation",
			"level": "Advanced",
			"rating": 4,
			"yearsOfExperience": 11
		}
	],
	"openSourceProjects": [
		{
			"name": "Azure Maps Code Samples",
			"description": "Fixed typos in the GitHub Issue template.",
			"url": "https://github.com/Azure-Samples/AzureMapsCodeSamples"
		},
		{
			"name": "Microsoft Teams Docs",
			"description": "Fixed broken links in the documentation.",
			"url": "https://github.com/MicrosoftDocs/msteams-docs"
		},
		{
			"name": "Microsoft Bot Framework Solutions",
			"description": "Fixed incorrect path issue in code and broken link in the documentation.",
			"url": "https://github.com/microsoft/botframework-solutions"
		},
		{
			"name": "Microsoft Bot Builder Tools",
			"description": "Fixed grammar and improved formatting within the documentation.",
			"url": "https://github.com/microsoft/botbuilder-tools"
		},
		{
			"name": "Azure Docs",
			"description": "Improved the clarity of the documentation, fixed various typos and other mistakes as I came across them. Updated example scripts to pass missing arguments, contributed updates for sample code that had errors.",
			"url": "https://docs.microsoft.com/azure"
		},
		{
			"name": "Azure Cosmos DB Repository .NET SDK",
			"description": "Added support for using Managed Identities to authenticate. Added tests to ensure correct behaviour and prevent regressions.",
			"url": "https://github.com/IEvangelist/azure-cosmos-dotnet-repository"
		},
		{
			"name": "Microsoft SQL Server Technical Documentation",
			"description": "Fixed typos in the documentation.",
			"url": "https://github.com/MicrosoftDocs/sql-docs"
		},
		{
			"name": "Azure Tips and Tricks",
			"description": "Fixed typos in the documentation.",
			"url": "https://github.com/microsoft/AzureTipsAndTricks"
		},
		{
			"name": "Python Audio Analysis",
			"description": "Added support for an optional output directory, running analysis over a directory, and providing min/max bounds for durations.",
			"url": "https://github.com/BeigeBadger/pyAudioAnalysis"
		},
		{
			"name": "Zen Audio Player",
			"description": "Added support for retrieving and conditionally showing the description for a video.",
			"url": "https://github.com/zen-audio-player/zen-audio-player.github.io"
		}
	],
	"jobHistory": [
		{
			"company": "Education Perfect",
			"position":"Senior Software Engineer",
			"website": "https://www.educationperfect.com/",
			"startDate": "2024-03-18",
			"start":"March 2024",
			"endDate": "",
			"end": "",
			"location": "Hamilton, New Zealand",
			"workModel": "Remote",
			"responsibilities":[
				"Delivered a modern, accessible Micro-Frontend (MFE) replacement for Education Perfect's largest user base (students), as part of a cross-functional team. Contributed to and maintained multiple MFEs, and worked on the back-end monolith and microservice codebases that supported our MFEs.",
				"Collaborated with diverse business stakeholders to identify and resolve issues. Worked closely with Quality Assurance Engineers, Designers, and Product Owners to ensure that solutions with both robust and aligned with the product vision. Identified and resolved customer-reported issues and supported various cross-team initiatives."
			],
			"highlights":[
				"<strong>Lead initiatives and assisted in technical investigations</strong> - Took ownership of the internationalisation, load testing, and front-end instrumentation initiatives within my team, this included upskilling other team members to support these initiatives going forward and providing recommendations to the business. As part of a select group, participated in engineering-wide technical investigations related to platform performance and stability improvements, and the removal of our legacy authentication system.",
				"<strong>Improved front-end development skills</strong> - Developed pages and components which followed the Atomic Design Methodology, using React/Typescript and GraphQL. Used React Aria components and other tools to ensure that UI elements were accessible according to the WCAG 2.2 guidelines. Wrote component, unit and integration tests using Vitest and React Testing Library, and implemented end to end tests using Cypress.",
				"<strong>Contributed to engineering templates and documentation</strong> - Performed quality of life improvements and bug fixes to our templates for CI/CD, microservices, and MFEs. Used my initiative to update outdated documentation and guides, wrote documentation both technical and non-technical documentation for an internal audience.",
				"<strong>Migrated incentives system to a microservice</strong> - Worked with a small team to migrate the existing code base from the Monolith to a new microservice using Domain-Driven Design and Event-Driven Architecture. This involved a zero-downtime migration of a core piece of the progression system that required updating several consuming MFEs and ensuring that existing user functionality remained intact.",
				"<strong>Delivered Content Authoring replacement</strong> - Inherited a partially completed but strategically important initiative to replace the existing Content Authoring system, driving it to a successful and more complete implementation. This involved developing in two MFEs and two microservices, as well as collaborating with three other teams and integrating with their codebases. Demonstrated leadership by mentoring new team members, implementing observability dashboards, developing a comprehensive (unit, integration, architecture) test suite, and leading technical investigations."
			]
		},
		{
			"company": "Aware Group",
			"position": "Senior Software Engineer",
			"website": "https://www.awaregroup.com/",
			"startDate": "2023-03-08",
			"start": "March 2023",
			"endDate": "2024-03-12",
			"end": "March 2024",
			"location": "Hamilton, New Zealand",
			"workModel": "Hybrid",
			"responsibilities": [
				"Worked as part of a cross-functional team to deliver bespoke solutions that leveraged the Azure platform and adhered to domain best practices. Responsible for meeting billable targets by completing work within the agreed time frames and budget. Took ownership for the long-term maintenance of several existing client solutions had support agreements in place. Proactively identified risks, communicated concerns and potential mitigations or remedial actions to both internal and external stakeholders.",
				"Continued developing skills in other technical practices through use of professional development time, volunteering to work outside of the Software Engineering practice, and being assigned to non-Software projects. Assisted colleagues in their personal and professional development by providing mentoring, emotional support, and technical guidance."
			],
			"highlights": [
				"<strong>Planned and delivered customer workshops</strong> - Successfully led both single day and multi-day workshops and events. These sessions varied from one-on-one coaching to facilitating activities for larger groups. A pragmatic and flexible approach was used throughout to overcome technical and environmental roadblocks during these workshops. The vast majority of these events were conducted in different timezones with customers for whom English was not their primary language.",
				"<strong>Increased proficiency with Infrastructure as Code solutions</strong> - Completed several Infrastructure as Code projects; client requirements dictated the tooling, all solutions used either Bicep or Terraform. Continued to develop expertise in this area by keeping across the latest developments and best practices. Provided guidance and support for colleagues who had less experience in this area. Used various frameworks, development methodologies, and tools to build and deploy solutions.",
				"<strong>Heavily involved in development of workshop materials</strong> - Created technical content and exemplars for attendees to work through as part of Microsoft-funded events. This content was the core focus of an on-going series of multi-day events throughout Asia-Pacific that were run remotely to educate the community on Microsoft products and workflows; such as DevOps and GitHub or Deploying Open-Source Software and tools on Azure. Reviewed, tested, and oversaw the development of content packs created by others.",
				"<strong>Developed OpenAI solutions for clients</strong> - Delivered several solutions for clients that leveraged OpenAI models to provide a private and secure ChatGPT experience for their staff. Both traditional Web Applications and Microsoft Teams bots were used to provide access to the chat interface. A separate solution used an OpenAI model in conjunction with OCR and Form Recognition tools to extract and format data from photos and documents, this data was then ingested by a client system."
			]
		},
		{
			"company": "Aware Group",
			"position": "Product Technical Lead (Secondment)",
			"website": "https://www.awaregroup.com/",
			"startDate": "2022-09-05",
			"start": "September 2022",
			"endDate": "2023-03-07",
			"end": "March 2023",
			"location": "Hamilton, New Zealand",
			"workModel": "Hybrid",
			"responsibilities": [
				"Provided technical and people leadership to the newly formed Product team that was responsible for further development on several existing MVP solutions which would enable them to move into the scale stage of their lifecycle. Worked with the Director of Product to ideate, design, architect, and deliver hardware and SaaS solutions to customers. Acted as a role model for the team and those in the wider business by personally demonstrating the processes and behaviours required to successfully deliver value in a timely manner, while still maintaining a focus on quality. Worked with stakeholders to assess the suitability of, and plan for, the future integration of other offerings in the product solution portfolio. Actively contributed to the growth of team members through mentoring, regular one-on-ones, setting goals and having career conversations. Empowered people to take ownership and be accountable for deliverables, while providing appropriate levels of emotional and technical support.",
				"Collaborated with others to understand requirements and technical challenges, then evaluated potential solutions and presented prioritised actions to management for approval. Proactively raised concerns and implemented process improvements. Participated in peer-programming and mobbing sessions which enabled opportunities for two-way mentoring, knowledge-sharing, and increased team cohesion. Oversaw and provided technical guidance on the delivery of multiple parallel workstreams (Web, Data Platform, Embedded Development, Model Training Pipelines, and Operational tasks). Took responsibility for the technical direction, priority, and delivery of both technical and operational tasks."
			],
			"highlights": [
				"<strong>Improved the onboarding/new developer experience</strong> - Was a driving force behind the creation of both technical and non-technical documentation for all areas of the Pathways product. Stressed the importance and benefits of documentation, and having a single-source of the truth that the team and attached resources could refer to. Lead by example through the creation of documentation and architecture diagrams, delegated this task to subject matter experts where appropriate and to help ingrain it within the team culture. Comprehensive documentation was created for the set up of development environments, the use of common tools, and how to perform various operational tasks.",
				"<strong>Gained further embedded software development experience</strong> - Worked with team members to up-skill where necessary. Expanded knowledge of embedded software development to Linux services backed by Python code and running on various Raspberry Pi models. Learnt how to interact with and troubleshoot hardware, use various tools to debug embedded applications, and work within the constraints of limited resources.",
				"<strong>Implemented processes to improve team performance</strong> - Consulted with internal and external stakeholders to get buy-in for implementing new processes. These processes introduced engineering and operational rigour to a previously unstructured way of working, improved team efficiency, and reduced errors. Advocated for and implemented regular team ceremonies such as daily stand-ups with the sprint board as the centerpiece, sprint planning, sprint retrospective, and backlog refinement. Ensured continued engagement with and adherence to processes by using social contracts and fostering a culture of continuous improvement.",
				"<strong>Increased traceability, accountability, and visibility</strong> - Carried out initiatives to improve oversight in various areas of the delivery lifecycle. Added tags to artifacts so that they could easily be connected back to the commit and pipeline run. Introduced pull request templates to standardize our approach and ensure that important steps and context were not overlooked. Integrated notification with common tooling and regularly communicated with stakeholders outside of the team to improve the visibility of work. Sourced materials for hardware storage and designed a sign-in/out process to increase traceability. Helped create relevant and achievable sprint goals, ensured that work in the sprint related to the goals and had a primary person responsible for achieving it, and reflected on whether or not the goals were achieved. Enhanced financial observability by configuring environment spend, resource quota use, and forecasted budget consumption alerts to enable early intervention and action to be taken."
			]
		},
		{
			"company": "Aware Group",
			"position": "Senior Software Engineer",
			"website": "https://www.awaregroup.com/",
			"startDate": "2020-11-01",
			"start": "October 2020",
			"endDate": "2022-09-02",
			"end": "September 2022",
			"location": "Hamilton, New Zealand",
			"workModel": "Hybrid",
			"responsibilities": [
				"Continued delivering solutions using the Azure platform and DevOps best practices. Scoped and designed the architecture and the security posture for new pieces of work. Shifted into a leadership role, independently ran projects and managed team members across multiple disciplines to ensure that deliverables were on time and met the requirements. Heavily involved in the onboarding process, including performing inductions for engineering staff both inside and outside of the software engineering discipline, and ensuring that new-hires were set up for success. Learned and practiced candidate evaluation skills for technical hires, gained practical experience with pre/post-interview tasks.",
				"Utilised professional development time to undergo training to further develop leadership and coaching skills, so that different styles could be utilized, depending on the situation. Developed content for team standards, style guides, templates, and onboarding collateral to ensure that a consistent approach was taken to building solutions. Demonstrated flexibility and acquired new skills by completing an extended placement as a Data Platform Engineer. Gave back to the development community by contributing to open-source projects and answering questions on developer forums."
			],
			"highlights": [
				"<strong>Created a data platform</strong> - Worked with a Data Platform Engineer and the client to design and deliver a Data Lake and associated pipelines for a major transportation hub to ingest and reconcile movement data on a daily basis. This reporting data store replaced a legacy on-premises store with one hosted in Azure which was faster, more reliable, cheaper, and more accurate. Introduced new tools to the team that were instrumental in demonstrating milestones had been achieved and sharing knowledge across the team.",
				"<strong>Developed an integration solution using streaming architecture</strong> - Created two streaming solutions to handle different scenarios for the same client. One for ingesting changes from an on-premises SQL Server database into an Azure SQL database in near real-time. The other used a serverless approach for receiving different events from an online store, validating their schema, and passing them on to an existing customer endpoint. Both of these pipelines were engineered in a way that allowed them to be easily extended to handle additional tables and event types.",
				"<strong>Built an online quiz application</strong> - Delivered a solution that was used as part of an event with teams in 40 locations throughout Australia and New Zealand. This project included tight deadlines, hardware integration with controllers, and creating documentation on how each station needed to be set up. There was also a requirement to create an interface mode for quiz application where the questions and answers were able to be overlaid on the live stream of the host by the TV production company.",
				"<strong>Delivered an Internet of Things (IoT) platform</strong> - Integrated third-party devices with Azure IoT Hub for a major telecommunications company, the solution utilised Lambda architecture for event storage. In a technical leadership capacity: advised the client and internal staff on cloud and IoT best practices. Created a readily-extensible framework to allow for the integration of devices from other vendors and reporting on device behaviour. Set up an API endpoint with serverless back-end to allow developer access to device information and telemetry data that had been ingested whilst minimizing costs. Created Infrastructure-as-Code (IaC) templates to ensure consistency between environments and that future environments could be easily created.",
				"<strong>Contributed to an embedded software development project</strong> - Worked as part of a team to plan, build, and deliver an end to end software solution for a large agricultural client that run on custom hardware. This involved learning how to build a custom Linux distribution using Yocto, running containers on Linux within stringent hardware performance tolerances, and working with embedded resources on the client side."
			]
		},
		{
			"company": "Aware Group",
			"position": "Software Engineer",
			"website": "https://www.awaregroup.com/",
			"startDate": "2019-02-01",
			"start": "February 2019",
			"endDate": "2020-10-01",
			"end": "October 2020",
			"location": "Hamilton, New Zealand",
			"workModel": "Office",
			"responsibilities": [
				"Worked as part of a small Software Engineering team to deliver primarily web-based solutions that were built using the Platform as a Service (PaaS) and Infrastructure as a Service (IaaS) offerings on the Azure platform. Directly interacted with clients, their vendors, and our own partners for pre-sales work for both short and long-term engagements. Took ownership of being the technical authority on Chatbots, Form Recognizer, Power Apps, and the speech (Speech to Text) and language (LUIS and QnA Maker) Cognitive Services.",
				"Collaborated with Microsoft product teams to test new and upcoming features, and had multiple pull requests accepted for documentation across various Microsoft services and technologies. Successfully delivered projects whether working independently, collaborating with team members, or as an embedded resource within a client team (remote and in-person). Mentored and supported team members across professional practices, sharing knowledge throughout the business, and improving soft skills."
			],
			"highlights": [
				"<strong>Planned and delivered customer workshops</strong> - Successfully led multi-day workshops and events for customers. Operated as the sole facilitator/presenter for company-specific events, and collaborated as part of a team of coaches at events that were open to the selected Microsoft clients. These events covered a variety of topics and technologies, which could span multiple disciplines. This involved designing, writing, reviewing, and testing the content for practical exercises; usually on short notice, with limited preparation time, and occasionally for others to deliver.",
				"<strong>Developed an Automated Ad Serving solution</strong> - Successfully architected and delivered a project on-time, using a new language and unfamiliar technologies. Interacted directly with technical and non-technical staff on the client-side to: confirm requirements, prevent scope creep, sign off milestones, and exceed client expectations. The final solution significantly improved the client's go-live process, provided increased visibility of changes, and is readily extensible.",
				"<strong>Championed team improvements</strong> - Designed and implemented a pull request template for a repository that had a high number of integrations from different developers. Regularly shared development of new tools, functionality, productivity tips, and other announcements with colleagues to encourage continuous improvement. Created and shared lab exercises, along with a standardized template for workshop so that it could be re-used by other team members in the future.",
				"<strong>Delivered multiple Chatbot solutions</strong> - Worked with major municipal, regional, governance, and financial authorities to provide guidance on, architect, develop, and deploy Chatbots that provided self-service functionality to their clients or internal staff. Functioned as an embedded resource (on-site) in a client team for several months while developing a solution that allowed ratepayers to troubleshoot why their inorganic waste collection had been missed, this included integration with an existing knowledge base in Umbraco. All of the solutions were delivered using C#, Microsoft's Bot Framework, the Azure Bot Service, and a combination of QnA Maker or LUIS."
			]
		},
		{
			"company": "Smartrak",
			"position": "Software Engineer",
			"website": "https://smartrak.com/",
			"startDate": "2016-06-01",
			"start": "May 2016",
			"endDate": "2019-01-31",
			"end": "February 2019",
			"location": "Hamilton, New Zealand",
			"workModel": "Office",
			"responsibilities": [
				"Served as a key member of the software development team charged with maintaining and iterating upon core web applications used both internally and externally. Collaborated with stakeholders across departments to assist with the delivery of innovative new products and solutions that met client requirements and matched the Smartrak vision.",
				"Volunteered to mentor Junior Software Engineers and interns, for mutual benefit. Wrote robust, reusable, and well-tested code that adhered to design patterns and social contracts within the team."
			],
			"highlights": [
				"<strong>Improved soft skills</strong> - Gave technical presentations on testing and Software Engineering principles to the development team. Attended Agile training, which led to running daily stand-ups and sprint retrospectives for the team.",
				"<strong>Developed an authentication proxy</strong> - Worked with a Senior Software Engineer to scope, plan, then independently implement a crucial middleware component that helped deliver an API solution, that utilised JSON Web Tokens (JWTs) for authentication, Entity Framework, and OWIN.",
				"<strong>Introduced new ways of testing</strong> - Developed an integration test suite that covers critical functionality across core systems, using Selenium WebDriver to test user interface behaviour, which meant that regressions were caught.",
				"<strong>Designed and delivered an MVP for modernised internal APIs</strong> - Researched and developed the initial prototype project using ASP.NET Web APIs. Made vital contributions to the team that delivered the finished product using ASP.NET Web APIs, Entity Framework, and claims-based authorisation."
			]
		},
		{
			"company": "Smartrak",
			"position": "Junior Software Engineer/IT Administrator",
			"website": "https://smartrak.com/",
			"startDate": "2013-12-31",
			"start": "December 2014",
			"endDate": "2016-05-31",
			"end": "May 2016",
			"location": "Hamilton, New Zealand",
			"workModel": "Office",
			"responsibilities": [
				"Contributed to several large projects for external clients in addition to supporting critical customer-facing systems. A member of the team that delivered the In-Cab System (ICS) and Smart Fleet Management System solutions to Fonterra using .NET and open-source technologies.",
				"Willingly undertook training as an IT Administrator; this role involved managing relationships with internal staff, external contractors and third-party vendors to ensure hardware and software systems ran smoothly, and licenses remained current."
			],
			"highlights": [
				"<strong>Developed and integrated multi-platform systems</strong> - Helped develop the ICS application that ran on a tablet, along with the Smart FMS portal. The technologies used were WPF, Razor, ReactJS, SQLite, and PostgreSQL.",
				"<strong>Supported the rollout of Fonterra ICS hardware</strong> - Independently researched, developed and implemented the processes for the setup of Fonterra hardware. In addition to this, a solution that allowed support staff to remotely control the device in each truck through a web application was implemented."
			]
		},
		{
			"company": "Smartrak",
			"position": "Software Engineer Intern",
			"website": "https://smartrak.com/",
			"startDate": "2012-11-01",
			"start": "November 2012",
			"endDate": "2013-12-31",
			"end": "December 2013",
			"location": "Hamilton, New Zealand",
			"workModel": "Office",
			"responsibilities": [
				"Assisted with maintenance of core web applications. Focused on bringing user experience improvements to internal systems and learning real-world Software Engineering best practices."
			],
			"highlights": [
				"<strong>Re-skinned and made the customer-facing Administration website responsive</strong> - Updated an ASP.NET Web Forms site with over 30 pages that was using legacy styling, to use a modern framework which enabled staff, customers, and our vendors to use the site on devices with various screen resolutions."
			]
		}
	],
	"publications": [
		{
			"name": "Massive Ontology Interface",
			"publisher": "The University of Waikato",
			"summary": "Paper presented at CHINZ 2013: 14th Annual Conference of the New Zealand Chapter of the ACM Special Interest Group on Computer-Human Interaction, 15-16 November 2013 — Christchurch, New Zealand.",
			"releaseDate": "2013-01-01",
			"url": "https://researchcommons.waikato.ac.nz/handle/10289/8410",
			"authors": [
				"Stannett, M.",
				"Legg, C.",
				"Sarjant, S."
			],
			"fullReleaseDate": {
				"year": 2013,
				"month": null,
				"day": null
			}
		}
	],
	"qualifications": [
		{
			"institution": "Microsoft via Pearson VUE",
			"website": "https://www.credly.com/badges/790f8dd7-0f12-4f98-908c-d6c49092bc46/public_url",
			"studyType": "Microsoft Certified: Azure Fundamentals",
			"area": "",
			"result": "895/1000",
			"endorsement": "",
			"start": {
				"year": 2022,
				"month": 6
			},
			"end": {
				"year": 2022,
				"month": 6
			}
		},
		{
			"institution": "University of Waikato",
			"website": "https://www.waikato.ac.nz/",
			"studyType": "Bachelors of Computing and Mathematical Sciences",
			"area": "Computer Science",
			"result": "First Class Honours",
			"endorsement": "First Class Honours",
			"start": {
				"year": 2010,
				"month": 1
			},
			"end": {
				"year": 2014,
				"month": 1
			}
		}
	],
	"awards": [
		{
			"title": "Best Active Ageing Programme (Residential Living)",
			"date": "2021-12-03",
			"awarder": "Ageing Asia",
			"summary": "I worked as part of the wider teams to independently deliver the Quiznastics component of the Olympics@Ryman event (for Ryman Healthcare) that won an award at the Ageing Asia Awards.",
			"link": "https://ageingasia.com/industry-programmes/awards2021/",
			"display": true
		},
		{
			"title": "Business Transformation through Digital and IT Award (finalist - Auckland Airport)",
			"date": "2021-07-29",
			"awarder": "CIO Awards New Zealand",
			"summary": "I worked with group subject-matter experts at Auckland Airport, and as part of a small internal team to deliver a modern, cloud-hosted Data Platform that was a finalist for the 2021 New Zealand CIO Summit Awards.",
			"link": "https://www.ciosummit.co.nz/alumni",
			"display": true
		},
		{
			"title": "Digital & Application Innovation Award",
			"date": "2021-12-06",
			"awarder": "Microsoft",
			"summary": "I worked as part of the wider teams to independently deliver the Quiznastics component of the Olympics@Ryman event (for Ryman Healthcare) that won an award at the New Zealand Microsoft Partner Awards.",
			"link": "https://www.msnzpartnerawards.co.nz/",
			"display": true
		},
		{
			"title": "Azure Innovate Award",
			"date": "2019-10-18",
			"awarder": "Microsoft",
			"summary": "I was part of the team that delivered the Port Otago solution that won an award at the New Zealand Microsoft Partner Awards.",
			"link": "https://news.microsoft.com/en-nz/2019/10/18/microsoft-announces-2019-new-zealand-partner-awards-winners/",
			"display": true
		},
		{
			"title": "Best Honours Project Presentation",
			"date": "2013-11-01",
			"awarder": "University of Waikato Computer Science Department",
			"summary": "I was awarded the best presentation for my cohort (~50 students).",
			"display": false
		}
	],
	"valuePropositions": [
		{
			"description": "<strong>Experienced Software Engineer</strong> with the ability to develop full-stack applications that utilize design patterns, a variety of languages, and leverage the cloud to deliver innovative solutions for end users."
		},
		{
			"description": "<strong>Over ten years software engineering experience</strong> delivering predominantly web-based applications, primarily using .NET/C#."
		},
		{
			"description": "Strong emphasis on <strong>multi-layered testing</strong> using both unit, integration, and functional tests to ensure reliability and prevent regressions."
		},
		{
			"description": "<strong>Actively seeks to improve</strong> the software delivery process through automation, ChatOps, and discussion of best practices and new ideas."
		},
		{
			"description": "<strong>Values a strong team culture</strong>. Encourages team members to develop a shared sense of identity and purpose."
		},
		{
			"description": "Enjoys playing an active role in fostering a fun, friendly, and collaborative environment where <strong>mentoring others is valued</strong> and accepted as part of an employee's responsibilities."
		},
		{
			"description": "<strong>Comfortable working directly with clients</strong>, has experience leading projects, running in-person and remote workshops, and working as an embedded resource."
		},
		{
			"description": "<strong>Excellent written communication skills</strong>. Advocates for knowledge sharing through documentation, demonstrations, and hands-on training. Vast experience documenting processes, system architecture, technical walkthroughs, and functionality overviews for technical and non-technical staff."
		}
	],
	"references": [
		{
			"role": "Team Leader",
			"details": "Available by request"
		},
		{
			"role": "Project Manager",
			"details": "Available by request"
		},
		{
			"role": "Colleague",
			"details": "Available by request"
		}
	],
	"tooling": [
		{
			"name": "Languages",
			"current": [
				"C#",
				"HTML",
				"CSS",
				"SQL",
				"JavaScript/TypeScript",
				"Bash"
			],
			"historical": [
				"Python",
				"PowerShell"
			],
			"printOrder": 1
		},
		{
			"name": "Frameworks/Tools",
			"current": [
				"React",
				"Docker",
				"GraphQL",
				"Vitest",
				"Cypress",
				"React Testing Library",
				"Amplitude",
				"New Relic",
				"Tailwind CSS"
			],
			"historical": [
				"Entity Framework",
				"ASP.NET Core (Razor pages)",
				"jQuery",
				"ASP.NET (MVC, Web Forms)",
				"Notebooks (Jupyter, SQL)",
				"Selenium",
				"Redux",
				"Debezium",
				"Bootstrap",
				"Power Apps",
				"Dapper",
				"Microsoft Bot Framework",
				"Power BI",
				"Microsoft Teams",
				"Next.JS",
				"Open AI models"
			],
			"printOrder": 3
		},
		{
			"name": "Source Control",
			"current": [
				"Git"
			],
			"historical": [
				"SVN"
			],
			"printOrder": 2
		},
		{
			"name": "Continuous Integration, Delivery, and Deployment",
			"current": [
				"GitHub Actions"
			],
			"historical": [
				"Azure Pipelines",
				"TeamCity",
				"Octopus Deploy",
				"AppVeyor",
				"GitLab"
			],
			"printOrder": 4
		},
		{
			"name": "Cloud Experience",
			"current": [
				"Azure",
				"Amazon Web Services"
			],
			"historical": [
				"Google Cloud Platform"
			],
			"printOrder": 6
		},
		{
			"name": "Project Management",
			"current": [
				"Azure Boards",
				"JIRA",
				"Confluence",
				"Miro",
				"Figma"
			],
			"historical": [
				"Redmine",
				"Trello",
				"GitHub Projects"
			],
			"printOrder": 5
		},
		{
			"name": "Databases",
			"current": [
				"SQL Server",
				"PostgreSQL",
				"Redis",
				"DynamoDB"
			],
			"historical": [
				"SQLite",
				"Azure Table Storage",
				"Cosmos DB (NoSQL/Document DB)"
			],
			"printOrder": 7
		},
		{
			"name": "Infrastructure as Code",
			"current": [
				"Terraform"
			],
			"historical": [
				"ARM",
				"Bicep"
			],
			"printOrder": 8
		}
	],
	"meta": {
		"note": "This is a combined version of the old and new JSON Resume API to provide maximum compatibility. You will notice duplicated values in different fields.",
		"canonical": "https://raw.githubusercontent.com/jsonresume/resume-schema/master/resume.json",
		"version": "v1.0.0",
		"lastModified": "2020-12-29T15:53:00"
	}
}
